app/Http/Controllers/Erp/LoginController.php

select * from `admin` where `username` = 'admin' limit 1
update `admin` set `admin_ip` = '127.0.0.1', `admin_num` = 1, `admin`.`updated_at` = '2019-10-11 11:03:49' where `id` = 1
---
    public function store(Request $request)
    {
        $validator=Validator::make($request->all(),[
            "username"=>"required|between:2,16",
            "password"=>"required|between:6,20",
        ],[
            "username.required"=>"用户名必须填写",
            "username.between"=>"请输入2-16位的用户名",
            "password.required"=>"密码必须填写",
            "password.between"=>"请输入6-20位的密码",
        ]);
        if($validator->fails()){
            return response()->json(['code'=>'1','msg'=>$validator->errors()->first()]);
        }
        $ip=$request->getClientIp();
        //登录验证
        if(Auth::guard('admin')->attempt($request->only(['username','password']))){

            $time=date('Y-m-d H:i:s',time());
            $admin=Admin::where('username',$request->input('username'))->first();
            if($admin->status!='1'){
                $this->admin_log($request->input('username'),$request->input('password'),2,$ip,'Login_fail','此账户无法使用!请联系管理员!');
                return response()->json(['code'=>'1','msg'=>'此账户无法使用!请联系管理员!']);
            }
            if($admin->admin_ip!=null){
                Cookie::forever('l_ip',$admin->admin_ip);
                Cookie::forever('l_time',$admin->updated_at);